GopalSaraf/Practicals/PSDL/include/proc/pic18f8390.inc
// Register: LCDDATA4
#define LCDDATA4 LCDDATA4
LCDDATA4                                 equ 0F64h
// bitfield definitions
LCDDATA4_LCDDATA4_POSN                   equ 0000h
LCDDATA4_LCDDATA4_POSITION               equ 0000h
LCDDATA4_LCDDATA4_SIZE                   equ 0008h
LCDDATA4_LCDDATA4_LENGTH                 equ 0008h
LCDDATA4_LCDDATA4_MASK                   equ 00FFh
LCDDATA4_S32C0_POSN                      equ 0000h
LCDDATA4_S32C0_POSITION                  equ 0000h
LCDDATA4_S32C0_SIZE                      equ 0001h
LCDDATA4_S32C0_LENGTH                    equ 0001h
LCDDATA4_S32C0_MASK                      equ 0001h
LCDDATA4_S33C0_POSN                      equ 0001h
LCDDATA4_S33C0_POSITION                  equ 0001h
LCDDATA4_S33C0_SIZE                      equ 0001h
LCDDATA4_S33C0_LENGTH                    equ 0001h
LCDDATA4_S33C0_MASK                      equ 0002h
LCDDATA4_S34C0_POSN                      equ 0002h
LCDDATA4_S34C0_POSITION                  equ 0002h
LCDDATA4_S34C0_SIZE                      equ 0001h
LCDDATA4_S34C0_LENGTH                    equ 0001h
LCDDATA4_S34C0_MASK                      equ 0004h
LCDDATA4_S35C0_POSN                      equ 0003h
LCDDATA4_S35C0_POSITION                  equ 0003h
LCDDATA4_S35C0_SIZE                      equ 0001h
LCDDATA4_S35C0_LENGTH                    equ 0001h
LCDDATA4_S35C0_MASK                      equ 0008h
LCDDATA4_S36C0_POSN                      equ 0004h
LCDDATA4_S36C0_POSITION                  equ 0004h
LCDDATA4_S36C0_SIZE                      equ 0001h
LCDDATA4_S36C0_LENGTH                    equ 0001h
LCDDATA4_S36C0_MASK                      equ 0010h
LCDDATA4_S37C0_POSN                      equ 0005h
LCDDATA4_S37C0_POSITION                  equ 0005h
LCDDATA4_S37C0_SIZE                      equ 0001h
LCDDATA4_S37C0_LENGTH                    equ 0001h
LCDDATA4_S37C0_MASK                      equ 0020h
LCDDATA4_S38C0_POSN                      equ 0006h
LCDDATA4_S38C0_POSITION                  equ 0006h
LCDDATA4_S38C0_SIZE                      equ 0001h
LCDDATA4_S38C0_LENGTH                    equ 0001h
LCDDATA4_S38C0_MASK                      equ 0040h
LCDDATA4_S39C0_POSN                      equ 0007h
LCDDATA4_S39C0_POSITION                  equ 0007h
LCDDATA4_S39C0_SIZE                      equ 0001h
LCDDATA4_S39C0_LENGTH                    equ 0001h
LCDDATA4_S39C0_MASK                      equ 0080h
LCDDATA4_SEG32COM0_POSN                  equ 0000h
LCDDATA4_SEG32COM0_POSITION              equ 0000h
LCDDATA4_SEG32COM0_SIZE                  equ 0001h
LCDDATA4_SEG32COM0_LENGTH                equ 0001h
LCDDATA4_SEG32COM0_MASK                  equ 0001h
LCDDATA4_SEG33COM0_POSN                  equ 0001h
LCDDATA4_SEG33COM0_POSITION              equ 0001h
LCDDATA4_SEG33COM0_SIZE                  equ 0001h
LCDDATA4_SEG33COM0_LENGTH                equ 0001h
LCDDATA4_SEG33COM0_MASK                  equ 0002h
LCDDATA4_SEG34COM0_POSN                  equ 0002h
LCDDATA4_SEG34COM0_POSITION              equ 0002h
LCDDATA4_SEG34COM0_SIZE                  equ 0001h
LCDDATA4_SEG34COM0_LENGTH                equ 0001h
LCDDATA4_SEG34COM0_MASK                  equ 0004h
LCDDATA4_SEG35COM0_POSN                  equ 0003h
LCDDATA4_SEG35COM0_POSITION              equ 0003h
LCDDATA4_SEG35COM0_SIZE                  equ 0001h
LCDDATA4_SEG35COM0_LENGTH                equ 0001h
LCDDATA4_SEG35COM0_MASK                  equ 0008h
LCDDATA4_SEG36COM0_POSN                  equ 0004h
LCDDATA4_SEG36COM0_POSITION              equ 0004h
LCDDATA4_SEG36COM0_SIZE                  equ 0001h
LCDDATA4_SEG36COM0_LENGTH                equ 0001h
LCDDATA4_SEG36COM0_MASK                  equ 0010h
LCDDATA4_SEG37COM0_POSN                  equ 0005h
LCDDATA4_SEG37COM0_POSITION              equ 0005h
LCDDATA4_SEG37COM0_SIZE                  equ 0001h
LCDDATA4_SEG37COM0_LENGTH                equ 0001h
LCDDATA4_SEG37COM0_MASK                  equ 0020h
LCDDATA4_SEG38COM0_POSN                  equ 0006h
LCDDATA4_SEG38COM0_POSITION              equ 0006h
LCDDATA4_SEG38COM0_SIZE                  equ 0001h
LCDDATA4_SEG38COM0_LENGTH                equ 0001h
LCDDATA4_SEG38COM0_MASK                  equ 0040h
LCDDATA4_SEG39COM0_POSN                  equ 0007h
LCDDATA4_SEG39COM0_POSITION              equ 0007h
LCDDATA4_SEG39COM0_SIZE                  equ 0001h
LCDDATA4_SEG39COM0_LENGTH                equ 0001h
LCDDATA4_SEG39COM0_MASK                  equ 0080h

// Register: LCDDATA5
#define LCDDATA5 LCDDATA5
LCDDATA5                                 equ 0F65h
// bitfield definitions
LCDDATA5_LCDDATA5_POSN                   equ 0000h
LCDDATA5_LCDDATA5_POSITION               equ 0000h
LCDDATA5_LCDDATA5_SIZE                   equ 0008h
LCDDATA5_LCDDATA5_LENGTH                 equ 0008h
LCDDATA5_LCDDATA5_MASK                   equ 00FFh
LCDDATA5_S40C0_POSN                      equ 0000h
LCDDATA5_S40C0_POSITION                  equ 0000h
LCDDATA5_S40C0_SIZE                      equ 0001h
LCDDATA5_S40C0_LENGTH                    equ 0001h
LCDDATA5_S40C0_MASK                      equ 0001h
LCDDATA5_S41C0_POSN                      equ 0001h
LCDDATA5_S41C0_POSITION                  equ 0001h
LCDDATA5_S41C0_SIZE                      equ 0001h
LCDDATA5_S41C0_LENGTH                    equ 0001h
LCDDATA5_S41C0_MASK                      equ 0002h
LCDDATA5_S42C0_POSN                      equ 0002h
LCDDATA5_S42C0_POSITION                  equ 0002h
LCDDATA5_S42C0_SIZE                      equ 0001h
LCDDATA5_S42C0_LENGTH                    equ 0001h
LCDDATA5_S42C0_MASK                      equ 0004h
LCDDATA5_S43C0_POSN                      equ 0003h
LCDDATA5_S43C0_POSITION                  equ 0003h
LCDDATA5_S43C0_SIZE                      equ 0001h
LCDDATA5_S43C0_LENGTH                    equ 0001h
LCDDATA5_S43C0_MASK                      equ 0008h
LCDDATA5_S44C0_POSN                      equ 0004h
LCDDATA5_S44C0_POSITION                  equ 0004h
LCDDATA5_S44C0_SIZE                      equ 0001h
LCDDATA5_S44C0_LENGTH                    equ 0001h
LCDDATA5_S44C0_MASK                      equ 0010h
LCDDATA5_S45C0_POSN                      equ 0005h
LCDDATA5_S45C0_POSITION                  equ 0005h
LCDDATA5_S45C0_SIZE                      equ 0001h
LCDDATA5_S45C0_LENGTH                    equ 0001h
LCDDATA5_S45C0_MASK                      equ 0020h
LCDDATA5_S46C0_POSN                      equ 0006h
LCDDATA5_S46C0_POSITION                  equ 0006h
LCDDATA5_S46C0_SIZE                      equ 0001h
LCDDATA5_S46C0_LENGTH                    equ 0001h
LCDDATA5_S46C0_MASK                      equ 0040h
LCDDATA5_S47C0_POSN                      equ 0007h
LCDDATA5_S47C0_POSITION                  equ 0007h
LCDDATA5_S47C0_SIZE                      equ 0001h
LCDDATA5_S47C0_LENGTH                    equ 0001h
LCDDATA5_S47C0_MASK                      equ 0080h
LCDDATA5_SEG40COM0_POSN                  equ 0000h
LCDDATA5_SEG40COM0_POSITION              equ 0000h
LCDDATA5_SEG40COM0_SIZE                  equ 0001h
LCDDATA5_SEG40COM0_LENGTH                equ 0001h
LCDDATA5_SEG40COM0_MASK                  equ 0001h
LCDDATA5_SEG41COM0_POSN                  equ 0001h
LCDDATA5_SEG41COM0_POSITION              equ 0001h
LCDDATA5_SEG41COM0_SIZE                  equ 0001h
LCDDATA5_SEG41COM0_LENGTH                equ 0001h
LCDDATA5_SEG41COM0_MASK                  equ 0002h
LCDDATA5_SEG42COM0_POSN                  equ 0002h
LCDDATA5_SEG42COM0_POSITION              equ 0002h
LCDDATA5_SEG42COM0_SIZE                  equ 0001h
LCDDATA5_SEG42COM0_LENGTH                equ 0001h
LCDDATA5_SEG42COM0_MASK                  equ 0004h
LCDDATA5_SEG43COM0_POSN                  equ 0003h
LCDDATA5_SEG43COM0_POSITION              equ 0003h
LCDDATA5_SEG43COM0_SIZE                  equ 0001h
LCDDATA5_SEG43COM0_LENGTH                equ 0001h
LCDDATA5_SEG43COM0_MASK                  equ 0008h
LCDDATA5_SEG44COM0_POSN                  equ 0004h
LCDDATA5_SEG44COM0_POSITION              equ 0004h
LCDDATA5_SEG44COM0_SIZE                  equ 0001h
LCDDATA5_SEG44COM0_LENGTH                equ 0001h
LCDDATA5_SEG44COM0_MASK                  equ 0010h
LCDDATA5_SEG45COM0_POSN                  equ 0005h
LCDDATA5_SEG45COM0_POSITION              equ 0005h
LCDDATA5_SEG45COM0_SIZE                  equ 0001h
LCDDATA5_SEG45COM0_LENGTH                equ 0001h
LCDDATA5_SEG45COM0_MASK                  equ 0020h
LCDDATA5_SEG46COM0_POSN                  equ 0006h
LCDDATA5_SEG46COM0_POSITION              equ 0006h
LCDDATA5_SEG46COM0_SIZE                  equ 0001h
LCDDATA5_SEG46COM0_LENGTH                equ 0001h
LCDDATA5_SEG46COM0_MASK                  equ 0040h
LCDDATA5_SEG47COM0_POSN                  equ 0007h
LCDDATA5_SEG47COM0_POSITION              equ 0007h
LCDDATA5_SEG47COM0_SIZE                  equ 0001h
LCDDATA5_SEG47COM0_LENGTH                equ 0001h
LCDDATA5_SEG47COM0_MASK                  equ 0080h
LCDDATA5_S40C15_POSN                     equ 0000h
LCDDATA5_S40C15_POSITION                 equ 0000h
LCDDATA5_S40C15_SIZE                     equ 0001h
LCDDATA5_S40C15_LENGTH                   equ 0001h
LCDDATA5_S40C15_MASK                     equ 0001h

