GopalSaraf/Practicals/PSDL/include/proc/pic18f8390.inc
#define SEG47COM0                        BANKMASK(LCDDATA5), 7, a
#define SEG47COM1                        BANKMASK(LCDDATA11), 7, a
#define SEG47COM2                        BANKMASK(LCDDATA17), 7, a
#define SEG47COM3                        BANKMASK(LCDDATA23), 7, a
#define SEG4COM0                         BANKMASK(LCDDATA0), 4, a
#define SEG4COM1                         BANKMASK(LCDDATA6), 4, a
#define SEG4COM2                         BANKMASK(LCDDATA12), 4, a
#define SEG4COM3                         BANKMASK(LCDDATA18), 4, a
#define SEG5                             BANKMASK(PORTD), 5, a
#define SEG5COM0                         BANKMASK(LCDDATA0), 5, a
#define SEG5COM1                         BANKMASK(LCDDATA6), 5, a
#define SEG5COM2                         BANKMASK(LCDDATA12), 5, a
#define SEG5COM3                         BANKMASK(LCDDATA18), 5, a
#define SEG6                             BANKMASK(PORTD), 6, a
#define SEG6COM0                         BANKMASK(LCDDATA0), 6, a
#define SEG6COM1                         BANKMASK(LCDDATA6), 6, a
#define SEG6COM2                         BANKMASK(LCDDATA12), 6, a
#define SEG6COM3                         BANKMASK(LCDDATA18), 6, a
#define SEG7                             BANKMASK(PORTD), 7, a
#define SEG7COM0                         BANKMASK(LCDDATA0), 7, a
#define SEG7COM1                         BANKMASK(LCDDATA6), 7, a
#define SEG7COM2                         BANKMASK(LCDDATA12), 7, a
#define SEG7COM3                         BANKMASK(LCDDATA18), 7, a
#define SEG8                             BANKMASK(PORTB), 1, a
#define SEG8COM0                         BANKMASK(LCDDATA1), 0, a
#define SEG8COM1                         BANKMASK(LCDDATA7), 0, a
#define SEG8COM2                         BANKMASK(LCDDATA13), 0, a
#define SEG8COM3                         BANKMASK(LCDDATA19), 0, a
#define SEG9                             BANKMASK(PORTB), 2, a
#define SEG9COM0                         BANKMASK(LCDDATA1), 1, a
#define SEG9COM1                         BANKMASK(LCDDATA7), 1, a
#define SEG9COM2                         BANKMASK(LCDDATA13), 1, a
#define SEG9COM3                         BANKMASK(LCDDATA19), 1, a
#define SEGEN0                           BANKMASK(LCDSE0), 0, b
#define SEGEN1                           BANKMASK(LCDSE0), 1, b
#define SEGEN10                          BANKMASK(LCDSE1), 2, b
#define SEGEN11                          BANKMASK(LCDSE1), 3, b
#define SEGEN12                          BANKMASK(LCDSE1), 4, b
#define SEGEN13                          BANKMASK(LCDSE1), 5, b
#define SEGEN14                          BANKMASK(LCDSE1), 6, b
#define SEGEN15                          BANKMASK(LCDSE1), 7, b
#define SEGEN16                          BANKMASK(LCDSE2), 0, b
#define SEGEN17                          BANKMASK(LCDSE2), 1, b
#define SEGEN18                          BANKMASK(LCDSE2), 2, b
#define SEGEN19                          BANKMASK(LCDSE2), 3, b
#define SEGEN2                           BANKMASK(LCDSE0), 2, b
#define SEGEN20                          BANKMASK(LCDSE2), 4, b
#define SEGEN21                          BANKMASK(LCDSE2), 5, b
#define SEGEN22                          BANKMASK(LCDSE2), 6, b
#define SEGEN23                          BANKMASK(LCDSE2), 7, b
#define SEGEN24                          BANKMASK(LCDSE3), 0, b
#define SEGEN25                          BANKMASK(LCDSE3), 1, b
#define SEGEN26                          BANKMASK(LCDSE3), 2, b
#define SEGEN27                          BANKMASK(LCDSE3), 3, b
#define SEGEN28                          BANKMASK(LCDSE3), 4, b
#define SEGEN29                          BANKMASK(LCDSE3), 5, b
#define SEGEN3                           BANKMASK(LCDSE0), 3, b
#define SEGEN30                          BANKMASK(LCDSE3), 6, b
#define SEGEN31                          BANKMASK(LCDSE3), 7, b
#define SEGEN32                          BANKMASK(LCDSE4), 0, b
#define SEGEN33                          BANKMASK(LCDSE4), 1, b
#define SEGEN34                          BANKMASK(LCDSE4), 2, b
#define SEGEN35                          BANKMASK(LCDSE4), 3, b
#define SEGEN36                          BANKMASK(LCDSE4), 4, b
#define SEGEN37                          BANKMASK(LCDSE4), 5, b
#define SEGEN38                          BANKMASK(LCDSE4), 6, b
#define SEGEN39                          BANKMASK(LCDSE4), 7, b
#define SEGEN4                           BANKMASK(LCDSE0), 4, b
#define SEGEN40                          BANKMASK(LCDSE5), 0, b
#define SEGEN41                          BANKMASK(LCDSE5), 1, b
#define SEGEN42                          BANKMASK(LCDSE5), 2, b
#define SEGEN43                          BANKMASK(LCDSE5), 3, b
#define SEGEN44                          BANKMASK(LCDSE5), 4, b
#define SEGEN45                          BANKMASK(LCDSE5), 5, b
#define SEGEN46                          BANKMASK(LCDSE5), 6, b
#define SEGEN47                          BANKMASK(LCDSE5), 7, b
#define SEGEN5                           BANKMASK(LCDSE0), 5, b
#define SEGEN6                           BANKMASK(LCDSE0), 6, b
#define SEGEN7                           BANKMASK(LCDSE0), 7, b
#define SEGEN8                           BANKMASK(LCDSE1), 0, b
#define SEGEN9                           BANKMASK(LCDSE1), 1, b
#define SEN                              BANKMASK(SSPCON2), 0, a
#define SENDB                            BANKMASK(TXSTA1), 3, a
#define SENDB1                           BANKMASK(TXSTA1), 3, a
#define SENDB2                           BANKMASK(TXSTA2), 3, a
#define SLPEN                            BANKMASK(LCDCON), 6, b
#define SMP                              BANKMASK(SSPSTAT), 7, a
#define SOSCEN                           BANKMASK(T1CON), 3, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SPEN                             BANKMASK(RCSTA1), 7, a
#define SPEN1                            BANKMASK(RCSTA1), 7, a
#define SPEN2                            BANKMASK(RCSTA2), 7, a
#define SREN                             BANKMASK(RCSTA1), 5, a
#define SREN1                            BANKMASK(RCSTA1), 5, a
#define SREN2                            BANKMASK(RCSTA2), 5, a
#define SRENA                            BANKMASK(RCSTA1), 5, a
#define SS                               BANKMASK(PORTF), 7, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSPEN                            BANKMASK(SSPCON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM0                            BANKMASK(SSPCON1), 0, a
#define SSPM012                          BANKMASK(LCDDATA12), 0, a
#define SSPM1                            BANKMASK(SSPCON1), 1, a
#define SSPM112                          BANKMASK(LCDDATA12), 1, a
#define SSPM2                            BANKMASK(SSPCON1), 2, a
#define SSPM212                          BANKMASK(LCDDATA12), 2, a
#define SSPM3                            BANKMASK(SSPCON1), 3, a
#define SSPM312                          BANKMASK(LCDDATA12), 3, a
#define SSPOV                            BANKMASK(SSPCON1), 6, a
#define START                            BANKMASK(SSPSTAT), 3, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP                             BANKMASK(SSPSTAT), 4, a
#define SWDTE                            BANKMASK(WDTCON), 0, a
#define SWDTEN                           BANKMASK(WDTCON), 0, a
#define SYNC                             BANKMASK(TXSTA1), 4, a
#define SYNC1                            BANKMASK(TXSTA1), 4, a
#define SYNC2                            BANKMASK(TXSTA2), 4, a
#define T08BIT                           BANKMASK(T0CON), 6, a
#define T0CKI                            BANKMASK(PORTA), 4, a
#define T0CS                             BANKMASK(T0CON), 5, a
#define T0IE                             BANKMASK(INTCON), 5, a
#define T0IF                             BANKMASK(INTCON), 2, a
#define T0IP                             BANKMASK(INTCON2), 2, a
#define T0PS0                            BANKMASK(T0CON), 0, a
#define T0PS1                            BANKMASK(T0CON), 1, a
#define T0PS2                            BANKMASK(T0CON), 2, a
#define T0SE                             BANKMASK(T0CON), 4, a
#define T13CKI                           BANKMASK(PORTC), 0, a
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1INSYNC                         BANKMASK(T1CON), 2, a
#define T1OSCEN                          BANKMASK(T1CON), 3, a
#define T1OSI                            BANKMASK(PORTC), 1, a
#define T1OSO                            BANKMASK(PORTC), 0, a
#define T1RD16                           BANKMASK(T1CON), 7, a
#define T1RUN                            BANKMASK(T1CON), 6, a
#define T1SYNC                           BANKMASK(T1CON), 2, a
#define T2CKPS0                          BANKMASK(T2CON), 0, a
#define T2CKPS1                          BANKMASK(T2CON), 1, a
#define T2OUTPS0                         BANKMASK(T2CON), 3, a
#define T2OUTPS1                         BANKMASK(T2CON), 4, a
#define T2OUTPS2                         BANKMASK(T2CON), 5, a
#define T2OUTPS3                         BANKMASK(T2CON), 6, a
#define T3CCP1                           BANKMASK(T3CON), 3, a
#define T3CCP2                           BANKMASK(T3CON), 6, a
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS019                        BANKMASK(LCDDATA19), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3CKPS119                        BANKMASK(LCDDATA19), 5, a
#define T3INSYNC                         BANKMASK(T3CON), 2, a
#define T3RD16                           BANKMASK(T3CON), 7, a
#define T3SYNC                           BANKMASK(T3CON), 2, a
#define T4CKPS016                        BANKMASK(LCDDATA16), 0, a
#define T4CKPS116                        BANKMASK(LCDDATA16), 1, a
#define T4OUTPS016                       BANKMASK(LCDDATA16), 3, a
#define T4OUTPS116                       BANKMASK(LCDDATA16), 4, a
#define T4OUTPS216                       BANKMASK(LCDDATA16), 5, a
#define T4OUTPS316                       BANKMASK(LCDDATA16), 6, a
#define TMR0IE                           BANKMASK(INTCON), 5, a
#define TMR0IF                           BANKMASK(INTCON), 2, a
#define TMR0IP                           BANKMASK(INTCON2), 2, a
#define TMR0ON                           BANKMASK(T0CON), 7, a
#define TMR1CS                           BANKMASK(T1CON), 1, a
#define TMR1IE                           BANKMASK(PIE1), 0, a
#define TMR1IF                           BANKMASK(PIR1), 0, a
#define TMR1IP                           BANKMASK(IPR1), 0, a
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE1), 1, a
#define TMR2IF                           BANKMASK(PIR1), 1, a
#define TMR2IP                           BANKMASK(IPR1), 1, a
#define TMR2ON                           BANKMASK(T2CON), 2, a
#define TMR3CS                           BANKMASK(T3CON), 1, a
#define TMR3CS019                        BANKMASK(LCDDATA19), 6, a
#define TMR3CS119                        BANKMASK(LCDDATA19), 7, a
#define TMR3IE                           BANKMASK(PIE2), 1, a
#define TMR3IF                           BANKMASK(PIR2), 1, a
#define TMR3IP                           BANKMASK(IPR2), 1, a
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TO                               BANKMASK(RCON), 3, a
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRISD0                           BANKMASK(TRISD), 0, a
#define TRISD1                           BANKMASK(TRISD), 1, a
#define TRISD2                           BANKMASK(TRISD), 2, a
#define TRISD3                           BANKMASK(TRISD), 3, a
#define TRISD4                           BANKMASK(TRISD), 4, a
#define TRISD5                           BANKMASK(TRISD), 5, a
#define TRISD6                           BANKMASK(TRISD), 6, a
#define TRISD7                           BANKMASK(TRISD), 7, a
#define TRISE4                           BANKMASK(TRISE), 4, a
#define TRISE5                           BANKMASK(TRISE), 5, a
#define TRISE6                           BANKMASK(TRISE), 6, a
#define TRISE7                           BANKMASK(TRISE), 7, a
#define TRISF0                           BANKMASK(TRISF), 0, a
#define TRISF1                           BANKMASK(TRISF), 1, a
#define TRISF2                           BANKMASK(TRISF), 2, a
#define TRISF3                           BANKMASK(TRISF), 3, a
#define TRISF4                           BANKMASK(TRISF), 4, a
#define TRISF5                           BANKMASK(TRISF), 5, a
#define TRISF6                           BANKMASK(TRISF), 6, a
#define TRISF7                           BANKMASK(TRISF), 7, a
#define TRISG0                           BANKMASK(TRISG), 0, a
#define TRISG1                           BANKMASK(TRISG), 1, a
#define TRISG2                           BANKMASK(TRISG), 2, a
#define TRISG3                           BANKMASK(TRISG), 3, a
#define TRISG4                           BANKMASK(TRISG), 4, a
#define TRISH0                           BANKMASK(TRISH), 0, a
#define TRISH1                           BANKMASK(TRISH), 1, a
#define TRISH2                           BANKMASK(TRISH), 2, a
#define TRISH3                           BANKMASK(TRISH), 3, a
#define TRISH4                           BANKMASK(TRISH), 4, a
#define TRISH5                           BANKMASK(TRISH), 5, a
#define TRISH6                           BANKMASK(TRISH), 6, a
#define TRISH7                           BANKMASK(TRISH), 7, a
#define TRISJ0                           BANKMASK(TRISJ), 0, a
#define TRISJ1                           BANKMASK(TRISJ), 1, a
#define TRISJ2                           BANKMASK(TRISJ), 2, a
#define TRISJ3                           BANKMASK(TRISJ), 3, a
#define TRISJ4                           BANKMASK(TRISJ), 4, a
#define TRISJ5                           BANKMASK(TRISJ), 5, a
#define TRISJ6                           BANKMASK(TRISJ), 6, a
#define TRISJ7                           BANKMASK(TRISJ), 7, a
#define TRMT                             BANKMASK(TXSTA1), 1, a
#define TRMT1                            BANKMASK(TXSTA1), 1, a
#define TRMT2                            BANKMASK(TXSTA2), 1, a
#define TUN0                             BANKMASK(OSCTUNE), 0, a
#define TUN1                             BANKMASK(OSCTUNE), 1, a
#define TUN2                             BANKMASK(OSCTUNE), 2, a
#define TUN3                             BANKMASK(OSCTUNE), 3, a
#define TUN4                             BANKMASK(OSCTUNE), 4, a
#define TX                               BANKMASK(PORTC), 6, a
#define TX1IE                            BANKMASK(PIE1), 4, a
#define TX1IF                            BANKMASK(PIR1), 4, a
#define TX1IP                            BANKMASK(IPR1), 4, a
#define TX2                              BANKMASK(PORTG), 1, a
#define TX2IE                            BANKMASK(PIE3), 4, a
#define TX2IF                            BANKMASK(PIR3), 4, a
#define TX2IP                            BANKMASK(IPR3), 4, a
#define TX8_9                            BANKMASK(TXSTA2), 6, a
#define TX8_92                           BANKMASK(TXSTA2), 6, a
#define TX9                              BANKMASK(TXSTA1), 6, a
#define TX91                             BANKMASK(TXSTA1), 6, a
#define TX92                             BANKMASK(TXSTA2), 6, a
#define TX9D                             BANKMASK(TXSTA1), 0, a
#define TX9D1                            BANKMASK(TXSTA1), 0, a
#define TX9D2                            BANKMASK(TXSTA2), 0, a
#define TXB2IE                           BANKMASK(PIE3), 4, a
#define TXBNIE                           BANKMASK(PIE3), 4, a
#define TXBNIF                           BANKMASK(PIR3), 4, a
#define TXBNIP                           BANKMASK(IPR3), 4, a
#define TXCKP                            BANKMASK(BAUDCON1), 4, a
#define TXCKP1                           BANKMASK(BAUDCON1), 4, a
#define TXD8                             BANKMASK(TXSTA2), 0, a
#define TXD82                            BANKMASK(TXSTA2), 0, a
#define TXEN                             BANKMASK(TXSTA1), 5, a
#define TXEN1                            BANKMASK(TXSTA1), 5, a
#define TXEN2                            BANKMASK(TXSTA2), 5, a
#define TXIE                             BANKMASK(PIE1), 4, a
#define TXIF                             BANKMASK(PIR1), 4, a
#define TXIP                             BANKMASK(IPR1), 4, a
#define UA                               BANKMASK(SSPSTAT), 1, a
#define ULPWUIN                          BANKMASK(PORTA), 0, a
#define VCFG0                            BANKMASK(ADCON1), 4, a
#define VCFG01                           BANKMASK(ADCON1), 4, a
#define VCFG1                            BANKMASK(ADCON1), 5, a
#define VCFG11                           BANKMASK(ADCON1), 5, a
#define VDIRMAG                          BANKMASK(HLVDCON), 7, a
#define VPP                              BANKMASK(PORTG), 5, a
#define VREFM                            BANKMASK(PORTA), 2, a
#define VREFP                            BANKMASK(PORTA), 3, a
#define WA                               BANKMASK(LCDPS), 4, b
#define WAIT0                            BANKMASK(MEMCON), 4, a
#define WAIT1                            BANKMASK(MEMCON), 5, a
#define WCOL                             BANKMASK(SSPCON1), 7, a
#define WERR                             BANKMASK(LCDCON), 5, b
#define WFT                              BANKMASK(LCDPS), 7, b
#define WM0                              BANKMASK(MEMCON), 0, a
#define WM1                              BANKMASK(MEMCON), 1, a
#define WRE                              BANKMASK(PORTE), 1, a
#define WUE                              BANKMASK(BAUDCON1), 1, a
#define WUE1                             BANKMASK(BAUDCON1), 1, a
#define ZERO                             BANKMASK(STATUS), 2, a
#define nA                               BANKMASK(SSPSTAT), 5, a
#define nADDRESS                         BANKMASK(SSPSTAT), 5, a
#define nBOR                             BANKMASK(RCON), 0, a
#define nDONE                            BANKMASK(ADCON0), 1, a
#define nPD                              BANKMASK(RCON), 2, a
#define nPOR                             BANKMASK(RCON), 1, a
#define nRBPU                            BANKMASK(INTCON2), 7, a
#define nRC8                             BANKMASK(RCSTA2), 6, a
#define nRI                              BANKMASK(RCON), 4, a
#define nT1SYNC                          BANKMASK(T1CON), 2, a
#define nT3SYNC                          BANKMASK(T3CON), 2, a
#define nTO                              BANKMASK(RCON), 3, a
#define nTX8                             BANKMASK(TXSTA2), 6, a
#define nW                               BANKMASK(SSPSTAT), 2, a
#define nWRITE                           BANKMASK(SSPSTAT), 2, a

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

#if _COMMON_SIZE_
psect udata_acs,class=COMRAM,space=SPACE_DATA,noexec,lowdata
#endif
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec,lowdata
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec,lowdata
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec,lowdata
psect udata,class=RAM,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,reloc=2
psect data,class=CONST,space=SPACE_CODE,reloc=2,noexec

#endif // _XC_INC_

#endif // _PIC18F8390_INC_
